add mermaid diagrams
